/**************************************************************************
 Stages.h

                                                    2012/04/20　名前
****************************************************************************/
#pragma once

#include "StdAfx.h"
#include "ButtonPlate.h"
#include "Stage_Result.h"

namespace wiz{

/**************************************************************************
 class DebugStage : public Stage;
 用途: メニュータイプのステージクラス
 　　（メニュータイプであれば、この派生クラスを作ってメニューにすると使いやすい）
****************************************************************************/
class DebugStage : public MenuStage{
public:
/**************************************************************************
 DebugStage(
 LPDIRECT3DDEVICE9 pD3DDevice,	//デバイス
 Stage* Par = 0					//親ステージ
 );
 用途: コンストラクタ
 戻り値: なし（失敗時は例外をthrow）
***************************************************************************/
	DebugStage(LPDIRECT3DDEVICE9 pD3DDevice,Stage* Par = 0);
};


/**************************************************************************
 class DebugMenu : public Stage;
 用途: デバッグ用ステージ
 　　（書く画面へ直接移動できる）
****************************************************************************/
class DebugMenu : public MenuStage{
public:
/**************************************************************************
 DebugStage(
 LPDIRECT3DDEVICE9 pD3DDevice,	//デバイス
 Stage* Par = 0					//親ステージ
 );
 用途: コンストラクタ
 戻り値: なし（失敗時は例外をthrow）
***************************************************************************/
	DebugMenu(LPDIRECT3DDEVICE9 pD3DDevice,Stage* Par = 0);
};


//end of namespace wiz.
}
