/**************************************************************************
 Stages.h

                                                    2012/04/20　名前
****************************************************************************/
#pragma once

#include "StdAfx.h"
#include "Stage_Menu.h"

namespace wiz{



/**************************************************************************
 class GameDialog : public MenuStage;
 用途: ゲームのダイアログクラス
****************************************************************************/
class GameDialog : public MenuStage{
public:
/**************************************************************************
GameDialog(
LPDIRECT3DDEVICE9 pD3DDevice	//デバイス
Stage* Par						//親ステージ
);
 用途: コンストラクタ
 戻り値: なし（失敗時は例外をthrow）
***************************************************************************/
	GameDialog(LPDIRECT3DDEVICE9 pD3DDevice,Stage* Par);
};



}
//end of namespace wiz.
