/**************************************************************************
 Stages.h

                                                    2012/04/20　名前
****************************************************************************/
#pragma once

#include "StdAfx.h"
#include "Stage_Menu.h"
namespace wiz{




/**************************************************************************
 class MusicSelect : public MenuStage;
 用途: メインメニュークラス
****************************************************************************/
class MusicSelect : public MenuStage{	//この形が派生クラス
public:

/**************************************************************************
MusicSelect(
LPDIRECT3DDEVICE9 pD3DDevice	//デバイス
);
 用途: コンストラクタ
 戻り値: なし（失敗時は例外をthrow）
***************************************************************************/
	MusicSelect(LPDIRECT3DDEVICE9 pD3DDevice);

};

}
//end of namespace wiz.
