/**************************************************************************
 Texture.h

 Texture ; 宣言
                                                    2012/03/04
****************************************************************************/


#pragma once

#include "StdAfx.h"
namespace wiz{
/**************************************************************************
 class Texture;
 用途: テクスチャのラッピングクラス
****************************************************************************/
class Texture{
	LPDIRECT3DTEXTURE9 m_pTexture;
public:
/**************************************************************************
 Texture(
	LPDIRECT3DDEVICE9 pD3DDevice,	//DirectXデバイス
	const wchar_t* filename	//テクスチャのファイル名
);
 用途: コンストラクタ
 戻り値: なし
***************************************************************************/
	Texture(LPDIRECT3DDEVICE9 pD3DDevice,const wchar_t* filename);
/**************************************************************************
 Texture(
	LPDIRECT3DDEVICE9 pD3DDevice,	//DirectXデバイス
	const wstring filename	//テクスチャのファイル名
);
 用途: コンストラクタ
 戻り値: なし
***************************************************************************/
	Texture(LPDIRECT3DDEVICE9 pD3DDevice,const wstring filename);
/**************************************************************************
 ~Texture();
 用途: デストラクタ
 戻り値: なし
***************************************************************************/
	~Texture();
/**************************************************************************
 const LPDIRECT3DTEXTURE9 getTexture() const
 用途: アクセッサ
 戻り値: なし
***************************************************************************/
	const LPDIRECT3DTEXTURE9 getTexture() const{
		return m_pTexture;
	}
};

}
//end of namespace wiz.

