/**************************************************************************
 Button.cpp

 Button; 定義
                                                    2012/03/04　名前 鴫原 徹
****************************************************************************/
#include "StdAfx.h"
#include "Button.h"

namespace wiz{



/**************************************************************************
 Button 定義部
****************************************************************************/
/**************************************************************************
 Button::Button(
	DWORD Cmd,						//選択実行されたときのコマンド
	DWORD Index,					//メニューステージ上のインデックス
    );
 用途: コンストラクタ
 戻り値: なし
****************************************************************************/
Button::Button(DWORD Cmd,DWORD Index)
:m_Index(Index),m_IsBoot(false),m_IsSelect(false),m_Command(Cmd)
{
	//もしインデックスが0番なら、初期状態で選択されている
	if(m_Index == 0){
		m_IsSelect = true;
	}
}
/**************************************************************************
 virtual ~Button::Button();
 用途: デストラクタ
 戻り値: なし
***************************************************************************/
Button::~Button(){

}



}
//end of namespace wiz.
