/**************************************************************************
 TatraFactory.h
 class TatraFactoryDBGS; 宣言
 class TatraFactoryDBGM; 宣言
                                                    2012/43/06　名前 鴫原 徹
****************************************************************************/
#pragma once

#include "../StdAfx.h"
#include "../Object.h"
namespace wiz{
namespace Tatra{
/**************************************************************************
 class TatraFactoryPlay;
 用途: デバッグステージの工場クラス
****************************************************************************/
class TatraFactoryPlay{
public:
/**************************************************************************
 TatraFactory(
	LPDIRECT3DDEVICE9 pD3DDevice,	//デバイス
	vector<Object*>& vec,			//オブジェクトの配列
	vector<Texture*>& TexVec		//テクスチャの配列
);
 用途: コンストラクタ（サンプルオブジェクトを配列に追加する）
 戻り値: なし
***************************************************************************/
	TatraFactoryPlay(LPDIRECT3DDEVICE9 pD3DDevice,vector<Object*>& vec,vector<Texture*>& TexVec);
/**************************************************************************
 ~TatraFactory();
 用途: デストラクタ
 戻り値: なし
***************************************************************************/
	~TatraFactoryPlay();
};

/**************************************************************************
 class TatraFactoryDBGS;
 用途: デバッグステージの工場クラス
****************************************************************************/
class TatraFactoryDBGS{
public:
/**************************************************************************
 TatraFactory(
	LPDIRECT3DDEVICE9 pD3DDevice,	//デバイス
	vector<Object*>& vec,			//オブジェクトの配列
	vector<Texture*>& TexVec		//テクスチャの配列
);
 用途: コンストラクタ（サンプルオブジェクトを配列に追加する）
 戻り値: なし
***************************************************************************/
	TatraFactoryDBGS(LPDIRECT3DDEVICE9 pD3DDevice,vector<Object*>& vec,vector<Texture*>& TexVec);
/**************************************************************************
 ~TatraFactory();
 用途: デストラクタ
 戻り値: なし
***************************************************************************/
	~TatraFactoryDBGS();
};


/**************************************************************************
 class TatraFactoryDBGM;
 用途: デバッグメニューの工場クラス
****************************************************************************/
class TatraFactoryDBGM{
public:
/**************************************************************************
 TatraFactory(
	LPDIRECT3DDEVICE9 pD3DDevice,	//デバイス
	vector<Object*>& vec,			//オブジェクトの配列
	vector<Texture*>& TexVec		//テクスチャの配列
);
 用途: コンストラクタ（サンプルオブジェクトを配列に追加する）
 戻り値: なし
***************************************************************************/
	TatraFactoryDBGM(LPDIRECT3DDEVICE9 pD3DDevice,vector<Object*>& vec,vector<Texture*>& TexVec);
/**************************************************************************
 ~TatraFactory();
 用途: デストラクタ
 戻り値: なし
***************************************************************************/
	~TatraFactoryDBGM();
};

}
}